<?php return array (
  'date' => 
  array (
    'validate' => '(?P<year>\\d{2,4})[/.-]\\h+(?P<month>(?:1[0-2]|[0]?[1-9]))[/.-]\\h+(?P<day>(?:3[01]?|2[0-9]|[01]?[0-9]))[/.-]',
    'match' => '\\p{N}{2,4}[/.-]\\h+\\p{N}[/.-]\\h+\\p{N}[/.-]',
  ),
  'dateTime' => 
  array (
    'validate' => '(?P<year>\\d{2,4})[/.-]\\h+(?P<month>(?:1[0-2]|[0]?[1-9]))[/.-]\\h+(?P<day>(?:3[01]?|2[0-9]|[01]?[0-9]))[/.-]\\h+(?P<ampm>(?:[aApP][mM]))\\h+(?P<hours>(?:[01]?\\d|2[0-3]))\\:(?P<minutes>[0-5]?\\d)',
    'match' => '\\p{N}{2,4}[/.-]\\h+\\p{N}[/.-]\\h+\\p{N}[/.-]\\h+(?:오전|오후)\\h+\\p{N}\\:\\p{N}{2}',
  ),
  'time' => 
  array (
    'validate' => '(?P<ampm>(?:[aApP][mM]))\\h+(?P<hours>(?:[01]?\\d|2[0-3]))\\:(?P<minutes>[0-5]?\\d)',
    'match' => '(?:오전|오후)\\h+\\p{N}\\:\\p{N}{2}',
  ),
  'am-pm' => true,
);
