Repository: rollerworks/search
Catalog: lib/Core/Resources/translations/validators.*.xlf
Languages: nl

source: Lower range-value {{ lower }} should be lower then upper range-value {{ upper }}.
nl: Begin van bereik {{ lower }}, moet lager zijn dan eind bereik {{ upper }}.

source: Field {{ field }} does not accept {{ type }} values.
nl: Veld {{ field }} accepteert geen {{ type }}.

source: Field {{ field }} is not registered in the FieldSet or available as alias.
nl: Veld {{ field }} is niet geregistreerd in de veldenset en is niet beschikbaar als alias.

source: Group exceeds maximum nesting level of {{ max }}.
nl: Groep {{ group }} overschrijdt het maximale diepte niveau van {{ max }}.

source: Group exceeds maximum number of groups {{ max }}.
nl: Groep {{ group }} overschrijdt het maximum aantal groepen {{ max }}.

source: Field {{ field }} value exceeds the maximum number of values per group {{ max }}.
nl: Veld {{ field }} overschrijdt het maximum aantal waardes per groep {{ max }}.

source: This value is not a valid birthday or age.
nl: Deze waarde is geen geldige leeftijd of geboortedatum.

source: This value is not a valid birthday.
nl: Deze waarde is geen geldige geboortedatum.

source: This value is not a valid datetime or date interval.
nl: Deze waarde is geen geldige datum en tijd, of tijdsinterval.

source: This value is not a valid datetime.
nl: Deze waarde is geen geldige datum en tijd.

source: This value is not a valid sorting direction. Accepted directions are "{{ directions }}".
nl: Deze waarde is geen geldige sorteer richting. De geaccepteerde richtingen zijn : "{{ directions }}".
